const rus = {
  // Header
  'header-cta': 'Обменять',
  'header-cta-desktop': 'Обменять',
  'lang-select-language': 'Язык',
  // INFO: Nav is used both in header and footer      
  'nav-home': 'Главная страница',
  'nav-exchange-rate': 'Курс',
  'nav-features': 'Особенности',
  'nav-guarantees': 'Гарантии',
  'nav-faq': 'FAQ',

  // Home page

  // block-1
  'block-1-title': 'Покупайте биткойны и криптовалюты мгновенно и безопасно!',
  'block-1-subtitle': 'Chaingex — это простая и безопасная платформа для создания своего криптопортфеля и обмена валюты с гарантией.',
  'block-1-cta': 'Обменять',
  'block-2-step-1': 'Выберите крипту для обмена',
  'block-2-step-2': 'Введите данные обмена',
  'block-2-step-3': 'Безопасный обмен криптовалют',

  // Popular currencies
  'popular-currencies-title': 'Популярные криптовалюты',
  'popular-currencies-colum-1': 'Название',
  'popular-currencies-colum-2': 'Цена',
  'popular-currencies-colum-3': 'Изменение цены',
  'popular-currencies-colum-4': 'Функции',

  // Change button is being translated using SCSS
  // 'popular-currencies-change': 'Обменять',
  'popular-currencies-sell': 'Продать',
  'popular-currencies-buy': 'Купить',

  'popular-currencies-button-see-all': 'Смотреть все валюты',
  'popular-currencies-button-hide-all': 'Скрыть все валюты',

  // Features
  'features-title': 'Наши лучшие пользователи по всему миру с широким охватом',
  'features-text': 'Наша платформа доступна людям по всему миру. Настоящим нам доверяют как лучшей платформе для криптотрейдинга.',
  'features-item-1-caption': 'Клиентов уже с нами',
  'features-item-2-caption': 'Операций обмена каждый день',
  'features-item-3-caption': 'На рынке криптовалют',
  "features-item-3-years": "Года",

  // Guarantees
  'guarantees-title': 'Обменивайте криптовалюту прямо сейчас и главное безопасно',
  'guarantees-text': 'Для того, чтобы безопасно обменять свою криптовалюту, вам нужно нажать всего одну кнопку, которая перенесет вас на сам обмен',
  'guarantees-button': 'Обменять',

  // FAQ
  'faq-title': 'Часто задаваемые вопросы (FAQ)',
  'faq-text': 'Здесь мы перечислили вопросы с ответами, которые часто задают нам наши клиенты',
  'faq-item-1-title': 'Как я могу конвертировать одну криптовалюту в другую?',
  'faq-item-1-body': 'Выберите опцию Конвертировать в приложении. Вы также можете найти его в панели обмена, если вы работаете с рабочего стола. Выберите криптовалюту, которую вы хотите конвертировать, и криптовалюту, которую вы хотите получить взамен. Введите сумму и подтвердите.',
  'faq-item-2-title': 'Как перейти с Young Platform на мой текущий аккаунт?',
  'faq-item-2-body': 'Чтобы перевести деньги на свой текущий счет, убедитесь, что вы делаете это из раздела Еврокошелек своей учетной записи. Нажмите “Снять” и введите название своего банка и свой IBAN. Перевод будет выполнен в течение 2-5 рабочих дней.',
  'faq-item-3-title': 'Как я могу купить криптовалюту?',
  'faq-item-3-body': 'Из раздела Обмен вашей учетной записи Young Platform перейдите на панель заказа. Выберите криптовалюту, которую хотите купить, введите сумму и подтвердите покупку. Вы можете выполнить ту же процедуру в приложении, нажав среднюю кнопку и выбрав ‘Купить’.',
  'faq-item-4-title': 'Как перевести криптовалюты с Young Platform на другую биржу?',
  'faq-item-4-body': 'Перейдите в раздел Кошелек своей учетной записи и нажмите на криптовалюту, которую хотите перевести. Нажмите ‘Снять’ и введите адрес криптокошелька назначения. Чтобы не потерять свои криптовалюты, скопируйте и вставьте адрес кошелька. Не вводите его вручную.',
}

export default rus;
